/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Không thể hoàn thành thao tác này";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Đã xảy ra lỗi không xác định (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Không thể Hoàn tất Tác vụ";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Thử lại sau.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Không thể Ghi";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Không thể Ghi";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Dùng %@ để dừng bất kỳ thao tác nào khác và thử lại."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Không thể Ghi";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Đã dừng Vận hành";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Không có đủ bộ nhớ để tiếp tục ghi tệp. Tạo chỗ trống bằng cách xóa bớt video hoặc ảnh hiện tại.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Đã đạt chiều dài tối đa cho tệp ghi này."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Đã đạt kích cỡ tối đa cho tệp ghi này."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Dùng thiết bị ghi để dừng bất kỳ thao tác nào khác và thử lại.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Đã đạt chiều dài tối đa cho tệp ghi này."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Không thể Ghi";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Thử ghi lại.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Không thể Dùng %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Dùng %@ để dừng bất kỳ thao tác nào khác và thử lại."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Không thể Dùng %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Dùng %@ để dừng bất kỳ thao tác nào khác và thử lại."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Đã dừng Ghi";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Dùng thiết bị ghi để dừng bất kỳ thao tác nào khác và thử lại.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Không thể Hoàn tất Tác vụ";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Thử lại sau.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Không thể Hoàn tất Xuất";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Thử xuất lại.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Không thể Giải mã";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Không thể giải mãi dữ liệu phương tiện. Có thể dữ liệu này bị hỏng.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Định dạng phương tiện này không được hỗ trợ.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Không thể Lưu";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Thử lưu lại.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Không thể dùng phương tiện này.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Không thể dùng phương tiện này.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Không thể dùng phương tiện này.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Không thể dùng phương tiện này.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Định dạng phương tiện này không được hỗ trợ.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Phương tiện này có thể bị hỏng.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Không thể Chụp ảnh";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Thử chụp ảnh lại.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Đã dừng Vận hành";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Vận hành không được hỗ trợ cho nội dung được bảo vệ."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Nội dung này không được cho phép."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Ứng dụng này không có quyền phát tệp này."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Không thể dùng phương tiện này.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Không thể Giải mã";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Không thể tìm thấy bộ giải mã được yêu cầu cho phương tiện này.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Không thể Mã hóa";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Không thể tìm thấy bộ mã hóa được yêu cầu cho phương tiện này.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Không thể Giải mã";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Bộ giải mã được yêu cầu cho phương tiện này đang bận.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Dừng bất kỳ thao tác nào khác giải mã phương tiện và thử lại.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Không thể Mã hóa";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Bộ mã hóa được yêu cầu cho phương tiện này đang bận.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Dừng bất kỳ thao tác nào khác mã hóa phương tiện và thử lại.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Không thể Dùng %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Không thể sử dụng %@ bằng một ứng dụng chạy trong nền."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Đã dừng Vận hành";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Vận hành không được hỗ trợ cho phương tiện này.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Đã dừng Vận hành";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Không thể soạn thảo video này theo thông tin đã được cung cấp.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Không thể Mở";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Không thể dùng phương tiện này.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Đã dừng Vận hành";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Không thể sử dụng tệp ghi đệm tại URL đích tải xuống.";
